[
  {
  "id": 1,
  "title": "风水八卦镜分类和用法 详细整理〖五维文化郭千伟〗",
  "title_zh": "风水八卦镜分类和用法 详细整理〖五维文化郭千伟〗",
  "source": "搜狐 极谦国学院",
  "link": "https://www.sohu.com/a/578529613_121376456",
  "tags": ["Feng Shui", "Bagua mirror", "classification", "usage"],
  "tags_zh": ["风水", "八卦镜", "分类", "用法"],
  "date": "2022-08-21",
  "summary_en": "This article is a detailed guide to the classification and usage of Bagua mirrors in Feng Shui by Guo Qianwei of the \"Five-dimensional Culture\" school. It explains the different types — flat, convex, concave, and Tai Chi mirrors — and their various functions such as blocking, transforming, collecting, and fighting off negative energy (sha qi). It also describes how to choose and orient the mirrors appropriately (e.g. flat mirrors should face outward if there is a sharp or pointed external architecture) and warns against improper positioning which might worsen negative effects.",
  "summary_zh": "本文为“极谦国学院”郭千伟关于风水八卦镜的分类与用法的详细整理。文章介绍了八卦镜主要分为平面镜、凸镜、凹镜和太极镜四种，以及这些镜子在风水中的不同功能，比如挡煞、化煞、收煞和斗煞。还说明了如何选镜子和如何摆放方向（例如，若外部有尖角或墙角等尖锐物，应将平面镜面朝外），并警告不当的摆放可能会加重煞气。",
  "best_quote_en": "Ba gua mirrors are mainly divided into flat, convex, concave and Tai Chi mirrors — each serving different functions like blocking, transforming, collecting or fighting off negative energies.",
  "best_quote_zh": "八卦镜主要分为平面镜、凸镜、凹镜和太极镜四种——各有不同作用，比如挡煞、化煞、收煞与斗煞。"
},
  {
  "id": 2,
  "title": "风水八卦镜分类和用法 详细整理〖五维文化郭千伟〗",
  "title_zh": "风水八卦镜分类和用法 详细整理〖五维文化郭千伟〗",
  "source": "搜狐 极谦国学院",
  "link": "https://www.sohu.com/a/578529613_121376456",
  "tags": ["Feng Shui", "Bagua mirror", "classification", "usage"],
  "tags_zh": ["风水", "八卦镜", "分类", "用法"],
  "date": "2022-08-21",
  "summary_en": "This article is a detailed guide to the classification and usage of Bagua mirrors in Feng Shui by Guo Qianwei of the \"Five-dimensional Culture\" school. It explains the different types — flat, convex, concave, and Tai Chi mirrors — and their various functions such as blocking, transforming, collecting, and fighting off negative energy (sha qi). It also describes how to choose and orient the mirrors appropriately (e.g. flat mirrors should face outward if there is a sharp or pointed external architecture) and warns against improper positioning which might worsen negative effects.",
  "summary_zh": "本文为“极谦国学院”郭千伟关于风水八卦镜的分类与用法的详细整理。文章介绍了八卦镜主要分为平面镜、凸镜、凹镜和太极镜四种，以及这些镜子在风水中的不同功能，比如挡煞、化煞、收煞和斗煞。还说明了如何选镜子和如何摆放方向（例如，若外部有尖角或墙角等尖锐物，应将平面镜面朝外），并警告不当的摆放可能会加重煞气。",
  "best_quote_en": "Ba gua mirrors are mainly divided into flat, convex, concave and Tai Chi mirrors — each serving different functions like blocking, transforming, collecting or fighting off negative energies.",
  "best_quote_zh": "八卦镜主要分为平面镜、凸镜、凹镜和太极镜四种——各有不同作用，比如挡煞、化煞、收煞与斗煞。"
},
  {
  "id": 3,
  "title": "教你学风水（13） 八卦的基本含义",
  "title_zh": "教你学风水（13） 八卦的基本含义",
  "source": "文学城 博客（杨先生）",
  "link": "https://www.wenxuecity.com/blog/201811/74555/39296.html",
  "tags": ["Feng Shui", "Bagua", "Eight Trigrams", "Meanings"],
  "tags_zh": ["风水", "八卦", "基本含义"],
  "date": "2018-11-29",
  "summary_en": "This blog post (part 13 in a series on learning Feng Shui) provides detailed meanings for each of the eight trigrams (八卦) in classical Chinese thought. For each trigram—Qian (乾), Dui (兑), Li (离), Zhen (震), Xun (巽), Kan (坎), Gen (艮), Kun (坤)—the article describes: its ‘proper image’ (正象), its virtue (卦德), conceptual associations (概念), spatial orientation (方位), numbers, correspondences to time periods, links to earthly branches or zodiac (天干地支), element (五行), kinds of people, parts of the body, animals, objects, places, shapes, colors, seasons, tastes, and disease associations. The descriptions are extensive, indicating how each trigram influences or symbolizes many aspects of life and nature.",
  "summary_zh": "这篇博客文章（风水系列第13篇）详细讲述了八卦中 **乾、兑、离、震、巽、坎、艮、坤** 每一个卦的含义。内容包括：它们的正象、卦德、概念、方位、数字、对应的时间段、天干地支、五行属性，以及与人物、人体部位、动物、物体、场所、形状、颜色、季节、味道、病象等的对应关系。文章内容非常丰富，展示八卦如何在传统文化中被用来解释环境与人与自然的对应关系。",
  "best_quote_en": "For each trigram, the article gives its proper image, virtue, concept, orientation, numbers, time, people, body parts, animals, objects, shapes, colors, seasons, taste, and even diseases—it shows how deeply the eight trigrams permeate traditional thought.",
  "best_quote_zh": "每一卦都讲其正象、卦德、概念、方位、数字、时间、人物、人体部位、动物、物体、场所、形状、颜色、季节、味道、病象——显示八卦在传统观念中渗透之深。"
},
  {
  "id": 4,
  "title": "易经入门基础知识",
  "title_zh": "易经入门基础知识",
  "source": "易学界",
  "link": "https://www.yilusoso.com/yjrm/",
  "tags": ["I Ching", "易经", "introduction", "八卦", "易传"],
  "tags_zh": ["易经", "入门", "八卦", "易传"],
  "date": "2025-09",  // 未标明具体日，只看当前页面
  "summary_en": "This web page provides basic introductory materials on the I Ching (易经), aimed at beginners. Topics include explanations of “潜龙勿用”, “元亨利贞”, advice on where to start when learning I Ching (such as mastering Yin-Yang and the Five Elements), the authorship and history of the I Ching, full text and commentary (易经, 易传, 十翼), and guides to understanding the 64 hexagrams and their meanings. The content is structured into a series format (“易经入门”), with articles such as “Where to begin studying I Ching”, “What ‘元亨利贞’ means”, “What ‘潜龙勿用’ means”, plus annotated explanations of foundational concepts.",
  "summary_zh": "此页面为“易学界”的“易经入门基础知识”，面向初学者介绍《易经》相关内容。包括“潜龙勿用”“元亨利贞”的含义，学习易经应从何处着手（如理解阴阳五行等基础理论）、易经的作者与发展历史、易经原文与易传（十翼）的介绍，以及六十四卦的含义和卦辞爻辞的注解。内容以系列文章形式呈现，循序渐进。",
  "best_quote_en": "The first lesson when learning the I Ching is mastering Yin-Yang theory — without understanding Yin and Yang, one easily gets stuck when interpreting hexagrams.",
  "best_quote_zh": "学习易经第一课是必须懂“阴阳理论”——若不理解阴阳，在研易过程中很容易“钻牛角尖”。"
},
{
  "id": 5,
  "title": "小六壬的解释和速断",
  "title_zh": "小六壬的解释和速断",
  "source": "脉脉 · 周思淼",
  "link": "https://maimai.cn/article/detail?fid=417336009&efid=BwsWjaW1eTKmpyNneIL_3g",
  "tags": ["小六壬", "预测", "占卜", "风水"],
  "tags_zh": ["小六壬", "预测", "占卜", "风水"],
  "date": "2018-05-21",
  "summary_en": "This article explains \"Xiao Liuren\", a Chinese divination method (“小六壬”), and “quick judgments” using it. It describes several outcome categories such as “Da An” (great safety), “Liu Lian” (lingering / delays), “Su Xi” (swift joy), “Chi Kou” (verbal disputes), “Xiao Ji” (small luck), “Kong Wang” (emptiness / bad omen). For example, “Da An” implies overall peace; “Liu Lian” suggests delays and complications; “Su Xi” indicates good news, especially if inquiries oriented towards “seeking wealth or business direction”; “Chi Kou” warns of arguments or lawsuits; “Kong Wang” is very unfavorable. Also it emphasizes that interpretations depend on date, hour, and one’s personal Eight Characters (“八字”), meaning even a “Kong Wang” day might be harmless if one’s fortune is good. The article also gives concrete combinations: e.g. “Da An” plus “Liu Lian” gives partial success but with problems; “Su Xi” plus “Xiao Ji” indicates things will go your way; “Chi Kou” plus “Kong Wang” is severe. The method is used for predicting outcomes in loss of objects, illness, travel, legal matters, marriage, etc.",
  "summary_zh": "本文解释了中国的一种占卜方式“小六壬”及其“速断”的用法。文章描述了若干结果类别，如“大安”（极好的平安）、“留连”（拖延、办事不顺）、“速喜”（快速的喜事）、“赤口”（口舌纠纷）、“小吉”、“空亡”（不吉）。比如“大安”总体平安；“留连”暗示拖延与复杂；“速喜”若求财或办事情往好方向；“赤口”预警争吵或诉讼；“空亡”非常不吉。文章还强调解释要看“日”、 “时”、以及个人的八字组合，即使是“空亡日”如果八字或运势好，也不一定遭遇严重问题。文中也给出了组合情况，例如“大安+留连”表示事情有始有终但有阻碍；“速喜+小吉”意味着进展顺利；“赤口+空亡”则是严重状况。此法可用于预测失物、疾病、出行、官司、婚姻等。",
  "best_quote_en": "Big safety (大安), as the name implies, means maximum peace — if you are seeking something, planning, or doing business, you can use it. Lost items are not far, illness has no grave danger, things are stable.",
  "best_quote_zh": "大安，顾名思义，最大的平安；求谋意思是求财，或者办事，谋划的意思……失物去不远，生病的人，没有生命危险……事情平安。"
},
{
  "id": 6,
  "title": "教你如何看懂《奇门遁甲》",
  "title_zh": "教你如何看懂《奇门遁甲》",
  "source": "凤凰网国学",
  "link": "https://guoxue.ifeng.com/a/20150722/44221308_0.shtml",
  "tags": ["奇门遁甲", "易经", "预测学", "天人地人", "心理分析"],
  "tags_zh": ["奇门遁甲", "易经", "预测学", "天人地人", "心理分析"],
  "date": "2015-07-22",
  "summary_en": "This article provides an introduction to 'Qimen Dunjia' (奇门遁甲), considered the highest level of predictive science in the I Ching tradition. It describes Qimen as a comprehensive system analyzing the laws of celestial bodies, human behavior, and earthly phenomena. The article explains the dynamic nature of Qimen, emphasizing the importance of interpreting the interactions between the 'Heaven' (九星), 'Earth' (九宫), 'Human' (八门), and 'Spirit' (八神). It discusses how these elements represent different aspects of a situation and how their combinations can reveal insights into psychological states, actions, and outcomes. The piece also highlights the necessity of understanding the 'use god' (用神) and the 'state' (状态) in Qimen analysis, stressing that accurate interpretation requires a holistic approach considering all variables.",
  "summary_zh": "本文介绍了《奇门遁甲》，被视为易经体系中最高层次的预测学。文章将奇门视为一个全面分析天体、人类行为和地球现象规律的系统。强调奇门的动态特性，解释了“天”（九星）、“地”（九宫）、“人”（八门）和“神”（八神）之间的相互作用，如何代表情况的不同方面，以及它们的组合如何揭示心理状态、行动和结果。文章还讨论了在奇门分析中理解“用神”和“状态”的必要性，强调准确的解读需要考虑所有变量的整体方法。",
  "best_quote_en": "Qimen Dunjia is the highest level of predictive science in the I Ching tradition, analyzing the laws of celestial bodies, human behavior, and earthly phenomena.",
  "best_quote_zh": "《奇门遁甲》是易经体系中最高层次的预测学，分析天体、人类行为和地球现象的规律。"
}
]
