[
  {
  "id": 1,
  "title": "用 JavaScript 刷 LeetCode 的正确姿势",
  "title_zh": "用 JavaScript 刷 LeetCode 的正确姿势",
  "source": "掘金",
  "link": "https://juejin.cn/post/6844903876206805005",
  "tags": ["LeetCode", "JavaScript", "算法", "数据结构", "刷题技巧"],
  "tags_zh": ["LeetCode", "JavaScript", "算法", "数据结构", "刷题技巧"],
  "date": "",
  "summary_en": "This guide explains the right approach to practicing LeetCode using JavaScript. It emphasizes building a solid foundation in data structures and algorithms, learning JS-specific techniques for problem-solving, following a structured progression from easy to hard, and reviewing solutions effectively. It also highlights the importance of analyzing time/space complexity and writing clean, readable code.",
  "summary_zh": "本指南总结了使用 JavaScript 刷 LeetCode 的正确方法。强调先打牢数据结构与算法基础，再熟悉 JS 在解题中的常用技巧，按照由易到难、分专题逐步突破的顺序练习，并在做题后总结与复盘。还强调了分析时间/空间复杂度、书写清晰易读的代码等习惯。",
  "best_quote_en": "Practice algorithms with JavaScript like training muscles: start light, focus on form, and gradually increase the weight.",
  "best_quote_zh": "用 JavaScript 刷题就像练肌肉：从轻量开始，重在姿势，然后逐渐加大重量。"
},
  {
  "id": 2,
  "title": "System Design in a Hurry — Introduction",
  "title_zh": "“速成”系统设计 —— 引言",
  "source": "Hello Interview",
  "link": "https://www.hellointerview.com/learn/system-design/in-a-hurry/introduction",
  "tags": ["System Design", "Interview Preparation", "Core Concepts", "Delivery Framework", "Key Technologies"],
  "tags_zh": ["系统设计", "面试准备", "核心概念", "交付框架", "关键技术"],
  "date": "", 
  "summary_en": "This section introduces 'System Design in a Hurry', a focused guide built by FAANG hiring managers and staff engineers to help candidates who have limited time before a system design interview. It emphasizes covering the most impactful ~20% of topics that tend to produce 80% of value. The guide suggests studying core concepts, key technologies, delivery framework, and common patterns. It also explains different types of system design interviews (product, infrastructure, object-oriented/low-level, frontend), and highlights what interviewers most look for: breaking down problems, high-level architecture, technical excellence, scalability considerations, and communication.",
  "summary_zh": "本节是“System Design in a Hurry”的引言部分，由 FAANG 的面试官与工程师设计，目的是帮助那些面试时间紧迫的候选人快速准备系统设计面试。它强调覆盖那些最具影响力的部分（大约 20% 的内容，但能带来约 80% 的价值）。建议学习核心概念、关键技术、面试交付框架与常见模式。还介绍了不同类型的系统设计面试（产品设计、基础设施设计、面向对象／低层设计、前端设计），并指出面试官主要考察哪些方面：问题拆分、高层架构、技术细节与可扩展性、沟通能力等。",
  "best_quote_en": "The intent here is to cover the last and most impactful 20%, not to teach you from scratch. While 'System Design in a Hurry' won't build mastery, it's still high-leverage.",
  "best_quote_zh": "重点在于覆盖最后那个最具影响力的20%，不是从头教你完全掌握。虽然“速成系统设计”不会让你马上成为大师，但它是高杠杆（高产出）的。"
},
{
"id": 3,
"title": "System Design in a Hurry: How to Prepare",
"title_zh": "系统设计速成：如何准备",
"source": "Hello Interview",
"link": "https://www.hellointerview.com/learn/system-design/in-a-hurry/how-to-prepare",
"tags": ["system design", "interview prep", "architecture", "scalability", "patterns"],
"tags_zh": ["系统设计", "面试准备", "架构", "可扩展性", "设计模式"],
"date": "2025-09-14",
"summary_en": "This article provides a concise guide on how to efficiently prepare for system design interviews. It outlines a structured preparation framework including understanding interview types, mastering core concepts such as scalability, CAP theorem, and data consistency, learning common design patterns like read-write separation and asynchronous processing, and practicing via real exercises and mock interviews. The resource emphasizes practical application and a focused, time-efficient approach to succeed in high-pressure interviews.",
"summary_zh": "本文提供了一个关于如何高效准备系统设计面试的简明指南。文章概述了结构化的准备框架，包括了解面试类型、掌握核心概念如可扩展性、CAP 定理和数据一致性、学习常用设计模式如读写分离和异步处理，以及通过实际练习和模拟面试进行实践。该资源强调实践应用和高效、聚焦的方法以在高压面试中取得成功。",
"best_quote_en": "A structured preparation and understanding of core system design concepts are key to succeeding in interviews under tight timelines.",
"best_quote_zh": "结构化的准备和对核心系统设计概念的理解，是在紧迫时间内面试成功的关键。"
},
{
"id": 4,
"title": "System Design in a Hurry: Delivery Framework",
"title\_zh": "系统设计速成：交付框架",
"source": "Hello Interview",
"link": "[https://www.hellointerview.com/learn/system-design/in-a-hurry/delivery](https://www.hellointerview.com/learn/system-design/in-a-hurry/delivery)",
"tags": \["system design", "interview prep", "delivery", "framework"],
"tags\_zh": \["系统设计", "面试准备", "交付", "框架"],
"date": "2025-09-14",
"summary\_en": "This section provides a structured framework to approach system design interviews. It emphasizes focusing on key aspects, organizing thoughts clearly, and delivering a feasible system design within limited time.",
"summary\_zh": "本章节提供了一个结构化的面试框架，强调聚焦关键点、清晰组织思路，并在有限时间内交付可行的系统设计。",
"best\_quote\_en": "A structured delivery approach ensures clarity and feasibility in system design interviews.",
"best\_quote\_zh": "结构化的交付方法能够确保系统设计面试中的清晰性和可行性。"
},
{
"id": 5,
"title": "System Design in a Hurry: Core Concepts",
"title\_zh": "系统设计速成：核心概念",
"source": "Hello Interview",
"link": "[https://www.hellointerview.com/learn/system-design/in-a-hurry/core-concepts](https://www.hellointerview.com/learn/system-design/in-a-hurry/core-concepts)",
"tags": \["system design", "core concepts", "scalability", "architecture"],
"tags\_zh": \["系统设计", "核心概念", "可扩展性", "架构"],
"date": "2025-09-14",
"summary\_en": "This section introduces key concepts essential for system design interviews, including scalability, load distribution, consistency, caching strategies, and hashing techniques.",
"summary\_zh": "本章节介绍系统设计面试中关键概念，包括可扩展性、负载分配、一致性、缓存策略和哈希技术。",
"best\_quote\_en": "Understanding core concepts like scalability and consistency is crucial for effective system design.",
"best\_quote\_zh": "理解可扩展性和一致性等核心概念对于高效的系统设计至关重要。"
},
{
"id": 6,
"title": "System Design in a Hurry: Key Technologies",
"title\_zh": "系统设计速成：关键技术",
"source": "Hello Interview",
"link": "[https://www.hellointerview.com/learn/system-design/in-a-hurry/key-technologies](https://www.hellointerview.com/learn/system-design/in-a-hurry/key-technologies)",
"tags": \["system design", "technologies", "database", "messaging", "caching"],
"tags\_zh": \["系统设计", "技术", "数据库", "消息队列", "缓存"],
"date": "2025-09-14",
"summary\_en": "This section covers essential technologies used in system design, including databases, caching systems like Redis, search engines like Elasticsearch, and messaging systems such as Kafka.",
"summary\_zh": "本章节涵盖系统设计中常用的关键技术，包括数据库、Redis 缓存系统、Elasticsearch 搜索引擎和 Kafka 消息队列。",
"best\_quote\_en": "Familiarity with key technologies accelerates practical system design and problem-solving.",
"best\_quote\_zh": "熟悉关键技术能加速实际系统设计和问题解决。"
},
{
"id": 7,
"title": "System Design in a Hurry: Patterns",
"title\_zh": "系统设计速成：设计模式",
"source": "Hello Interview",
"link": "[https://www.hellointerview.com/learn/system-design/in-a-hurry/patterns](https://www.hellointerview.com/learn/system-design/in-a-hurry/patterns)",
"tags": \["system design", "design patterns", "read-write separation", "asynchronous processing"],
"tags\_zh": \["系统设计", "设计模式", "读写分离", "异步处理"],
"date": "2025-09-14",
"summary\_en": "This section introduces common system design patterns such as read-write separation, caching strategies, asynchronous processing, and event-driven design.",
"summary\_zh": "本章节介绍系统设计中的常用模式，如读写分离、缓存策略、异步处理和事件驱动设计。",
"best\_quote\_en": "Using proven patterns simplifies complex system design challenges.",
"best\_quote\_zh": "使用成熟模式可以简化复杂的系统设计难题。"
},
{
"id": 8,
"title": "System Design in a Hurry: Problem Breakdowns",
"title\_zh": "系统设计速成：问题拆解",
"source": "Hello Interview",
"link": "[https://www.hellointerview.com/learn/system-design/problem-breakdowns/overview](https://www.hellointerview.com/learn/system-design/problem-breakdowns/overview)",
"tags": \["system design", "problem solving", "interview prep", "case study"],
"tags\_zh": \["系统设计", "问题解决", "面试准备", "案例分析"],
"date": "2025-09-14",
"summary\_en": "This section provides expert breakdowns of common system design problems, offering step-by-step approaches and insights to help candidates practice and learn from real examples.",
"summary\_zh": "本章节提供常见系统设计问题的专家拆解，提供逐步方法和见解，帮助候选人通过实际案例进行练习和学习。",
"best\_quote\_en": "Studying problem breakdowns enhances understanding and accelerates interview readiness.",
"best\_quote\_zh": "研究问题拆解可以加深理解并加速面试准备。"
},
  {
    "id": 9,
    "title": "Networking Essentials for System Design Interviews",
    "title_zh": "系统设计面试中的网络基础",
    "source": "Hello Interview",
    "link": "https://www.hellointerview.com/learn/system-design/core-concepts/networking-essentials",
    "tags": ["Networking", "System Design", "Interview Preparation"],
    "tags_zh": ["网络", "系统设计", "面试准备"],
    "date": "2025-09-14",
    "summary_en": "This guide covers the essential networking concepts needed for system design interviews, including the OSI model, key protocols, and their application in system design.",
    "summary_zh": "本指南涵盖了系统设计面试中所需的基本网络概念，包括OSI模型、关键协议及其在系统设计中的应用。",
    "best_quote_en": "Networking is a fundamental part of system design: you're nearly always going to be designing systems comprised of independent devices that communicate over a network.",
    "best_quote_zh": "网络是系统设计的基础：你几乎总是在设计由独立设备组成、通过网络通信的系统。"
  },
  {
    "id": 10,
    "title": "API Design for System Design Interviews",
    "title_zh": "系统设计面试中的API设计",
    "source": "Hello Interview",
    "link": "https://www.hellointerview.com/learn/system-design/core-concepts/api-design",
    "tags": ["API Design", "System Design", "Interview Preparation"],
    "tags_zh": ["API设计", "系统设计", "面试准备"],
    "date": "2025-09-14",
    "summary_en": "This article provides an overview of API design principles for system design interviews, covering REST, GraphQL, and RPC protocols, and their appropriate use cases.",
    "summary_zh": "本文概述了系统设计面试中的API设计原则，涵盖了REST、GraphQL和RPC协议及其适用场景。",
    "best_quote_en": "Default to REST unless you have a specific reason not to. It's well-understood, widely supported, and easy to implement.",
    "best_quote_zh": "除非有特定原因，否则默认使用REST。它被广泛理解、广泛支持且易于实现。"
  },
  {
    "id": 11,
    "title": "CAP Theorem Deep Dive for System Design Interviews",
    "title_zh": "系统设计面试中的CAP定理深入解析",
    "source": "Hello Interview",
    "link": "https://www.hellointerview.com/learn/system-design/deep-dives/cap-theorem",
    "tags": ["CAP Theorem", "System Design", "Distributed Systems"],
    "tags_zh": ["CAP定理", "系统设计", "分布式系统"],
    "date": "2025-09-14",
    "summary_en": "This deep dive explains the CAP theorem, its implications in distributed systems, and how to make trade-offs between consistency, availability, and partition tolerance.",
    "summary_zh": "本深入解析解释了CAP定理、其在分布式系统中的影响，以及如何在一致性、可用性和分区容忍性之间进行权衡。",
    "best_quote_en": "In any distributed system, partition tolerance is a must. Network failures will happen, and your system needs to handle them.",
    "best_quote_zh": "在任何分布式系统中，分区容忍性是必须的。网络故障将发生，您的系统需要处理它们。"
  },
  {
    "id": 12,
    "title": "Consistent Hashing Deep Dive for System Design Interviews",
    "title_zh": "系统设计面试中的一致性哈希深入解析",
    "source": "Hello Interview",
    "link": "https://www.hellointerview.com/learn/system-design/deep-dives/consistent-hashing",
    "tags": ["Consistent Hashing", "System Design", "Distributed Systems"],
    "tags_zh": ["一致性哈希", "系统设计", "分布式系统"],
    "date": "2025-09-14",
    "summary_en": "This article explores consistent hashing, a technique used to distribute data across a cluster of servers, and its application in systems like TicketMaster.",
    "summary_zh": "本文探讨了一致性哈希，这是一种用于将数据分布到服务器集群中的技术，以及它在像TicketMaster这样的系统中的应用。",
    "best_quote_en": "Consistent hashing is a technique that solves the problem of data redistribution when adding or removing an instance in a distributed system.",
    "best_quote_zh": "一致性哈希是一种解决在分布式系统中添加或删除实例时数据重新分配问题的技术。"
  }
]
